package com.thapar.CropSaviour.Service;

import org.jvnet.hk2.annotations.Service;
import org.telegram.telegrambots.meta.api.methods.send.SendMessage;

@Service
public class HindiRemedyService {
    public SendMessage riceDiseaseRemedy(String disease, Long chatId) {
        SendMessage remedy = new SendMessage();
        if (disease.equalsIgnoreCase("Bacterial Blight")) {
            remedy.setText("""
                    बैक्टीरियल ब्लाइट उपचार
                                                                                    
                    निवारक विधि
                    1. ब्लीचिंग पाउडर (100 ग्राम/ली) और जिंक सल्फेट (2%) से बीज उपचार करने से जीवाणु झुलसा कम हो जाता है।
                    2.बीज उपचार - एग्रीमाइसिन (0.025%) और वेटेबल सेरेसन (0.05%) में 8 घंटे के लिए बीज भिगोने के बाद 52-54oC पर 30 मिनट के लिए गर्म पानी का उपचार;
                    3. बीज को सेरेसन (0.1%) में 8 घंटे तक भिगोकर रखें और स्ट्रेप्टोसाइक्लिन (3 ग्राम प्रति 1 लीटर) से उपचारित करें;
                    4. नीम का तेल 3% या एनएसकेई 5% स्प्रे करें
                    5. बैक्टीरियल ब्लाइट के नियंत्रण के लिए ताजा गोबर के अर्क का छिड़काव करें। एक लीटर पानी में 20 ग्राम गोबर घोलें; बसने और छानने की अनुमति दें। सतह पर तैरनेवाला तरल का प्रयोग करें। (रोग के प्रारंभिक रूप से शुरू होकर और दूसरा पाक्षिक अंतराल पर)
                    सांस्कृतिक तरीके
                    1. नर्सरी को अलग-अलग ऊपरी इलाकों में अधिमानतः विकसित करें
                    2. रोपाई के दौरान रोपाई की कतरन से बचें।
                    3. खेत को सूखा दें (फसल के फूल आने की अवस्था को छोड़कर)
                    4. मातम और संपार्श्विक मेजबानों का विनाश
                    5. प्रभावित क्षेत्रों से पानी के बहाव से बचें
                    6. पौधों के बीच उचित दूरी बनाए रखें
                        
                        
                    अधिक जानकारी के लिए देखें https://farmer.gov.in/FarmerHome.aspx
                        
                    या किसान कॉल सेंटर (केसीसी) से संपर्क करें (टोल फ्री नंबर 1800-180-1551)""");
        } else if (disease.equalsIgnoreCase("Blast") || disease.equalsIgnoreCase("Leaf Blast")) {
            remedy.setText("""
                    विस्फोट के उपाय
                    निवारक उपाय
                    1. स्वस्थ या प्रमाणित बीज सामग्री का प्रयोग करें।
                    2. क्षेत्र में उपलब्ध पौधे प्रतिरोधी किस्में।
                    3. वर्षा ऋतु की शुरुआत के बाद, मौसम में जल्दी बीज बोएं।
                    4. अत्यधिक नाइट्रोजन उर्वरक से बचें और अनुप्रयोगों को दो में विभाजित करें
                    या अधिक उपचार।
                    5. नियमित सिंचाई से पौधों को सूखे के दबाव से बचाएं।
                    6. चावल के ठीक से बढ़ने के लिए उचित बाढ़ स्तर रखें।
                    7. निरंतर बाढ़ बनाए रखें और चावल के खेत की जल निकासी से बचें।
                    8. खर-पतवार और वैकल्पिक मेजबानों का नियंत्रण बनाए रखें।
                    9. यदि मिट्टी में सिलिकॉन की कमी हो तो सिलिकॉन उर्वरकों का प्रयोग करें।
                    10. सिलिकॉन के सस्ते स्रोतों में चावल की किस्मों के स्ट्रॉ शामिल हैं जिनमें उच्च
                    सिलिकॉन सामग्री।
                    11. लक्षणों के लिए नियमित रूप से अपने क्षेत्र की निगरानी करें।
                    12. कवक को फैलने से रोकने के लिए सभी संक्रमित पौधों के अवशेषों को नष्ट कर दें
                    क्षेत्र में।
                    13. आबादी को कम करने के लिए एक सरल और प्रभावी तरीके के रूप में फसल चक्र की योजना बनाएं।


                    अधिक जानकारी के लिए देखें https://farmer.gov.in/FarmerHome.aspx

                    या किसान कॉल सेंटर (केसीसी) से संपर्क करें (टोल फ्री नंबर 1800-180-1551) """);
        } else if (disease.equalsIgnoreCase("Brownspot")) {

            remedy.setText("""
                    ब्राउन स्पॉट उपचार
                                                                                   
                    सांस्कृतिक तरीके
                    1. क्योंकि रोग बीज जनित है, रोगमुक्त बीजों का प्रयोग करें।
                    2. वैकल्पिक और संपार्श्विक मेजबानों को हटाना।
                    3. प्रतिरोधी किस्मों का उपयोग नियंत्रण का सबसे किफायती साधन है।
                    4. एडीटी 44, पीवाई 4, कोरह 1, सीओ 44, कावेरी, भवानी, टीपीएस 4 और धनु जैसी प्रतिरोधी किस्मों को उगाना।
                    5. इष्टतम पौधों की वृद्धि के लिए उचित पोषण प्रदान करना और पानी के तनाव की रोकथाम भूरे धब्बे को नियंत्रित करने में सबसे महत्वपूर्ण कारक प्रतीत होते हैं।

                    निवारक तरीके
                    1. स्यूडोमोनास फ्लोरेसेंस @ 10 ग्राम/किलोग्राम बीज के साथ बीज उपचार के बाद 2.5 किग्रा की दर से अंकुर डुबकी या 100 लीटर में उत्पाद/हेक्टेयर घोलकर 30 मिनट के लिए डुबोएं।
                    2. बीज सोख/बीज उपचार कैप्टन या थिरम के साथ 2.0 ग्राम/किलोग्राम बीज
                    3.चूंकि कवक बीज संचरित होता है, बुवाई से पहले 10-12 मिनट के लिए गर्म पानी के बीज उपचार (53-54 डिग्री सेल्सियस) प्रभावी हो सकता है। यह उपचार अंकुर अवस्था में प्राथमिक संक्रमण को नियंत्रित करता है। बीज को ठंडे पानी में 8 घंटे तक भिगोने से उपचार की प्रभावशीलता बढ़ जाती है।


                    अधिक जानकारी के लिए देखें https://farmer.gov.in/FarmerHome.aspx

                    या किसान कॉल सेंटर (केसीसी) से संपर्क करें (टोल फ्री नंबर 1800-180-1551)""");

        } else if (disease.equalsIgnoreCase("Hispa")) {
            remedy.setText("""
                    1. खेत में ज्यादा खाद डालने से बचें।
                    2. पौधे के बीच की दूरी के परिणामस्वरूप अधिक पत्ती घनत्व होता है जो उच्च हिस्पा संख्या को सहन कर सकता है।
                    3. ब्लॉच खानों वाली पत्ती की नोक को नष्ट कर देना चाहिए।
                    4. मैनुअल संग्रह और भृंगों की हत्या - हाथ जाल।
                    5. कीटों के अंडे देने से रोकने के लिए, अंकुरों की युक्तियों को काटा जा सकता है।
                    6. प्ररोहों को मिट्टी में काटने और दफनाने से ग्रब की आबादी 75-92% तक कम हो सकती है।
                    7. Reduviid बग वयस्कों को खाता है।
                    8. मिथाइल पैराथियान 0.05% या क्विनालफॉस 0.05% का छिड़काव।
                    9. लीफ हॉपर वैक्टर को आकर्षित करने और नियंत्रित करने के साथ-साथ आबादी की निगरानी के लिए लाइट ट्रैप स्थापित किए जाने हैं।
                    10. प्रात:काल प्रकाश ट्रैप के पास उतरने वाले लीफहॉपर की आबादी को कीटनाशकों के छिड़काव/धूल से मार देना चाहिए।
                    11. इसका अभ्यास प्रतिदिन करना चाहिए।

                    सांस्कृतिक तरीके
                    1. टुंग्रो वायरस रोग के खिलाफ प्रतिरोधी किस्मों का रोपण रोग के प्रबंधन का सबसे किफायती साधन है।
                    2. आईआर 36, आईआर 50, एडीटी 37, पोनमनी, सीओ 45, सीओ 48, सुरेखा, विक्रमारी, भरणी, आईआर 36 और सफेद पोनी जैसी प्रतिरोधी किस्मों का प्रयोग करें।
                    3. सांस्कृतिक प्रबंधन प्रथाओं के बीच, रोपण की तारीख को समायोजित करने की सिफारिश की जाती है।
                    4. इसी तरह, रोग के मेजबान और वायरस और वैक्टर को खत्म करने के लिए कम से कम एक महीने की परती अवधि का पालन करना।
                    5. महामारी वाले क्षेत्रों में दलहन या तिलहन के साथ रोटेशन का पालन करें।
                    6. नीम केक @ 12.5 किग्रा/20 प्रतिशत नर्सरी बेसल खुराक के रूप में लगाएं।
                    7. फसल के तुरंत बाद ठूंठों को नष्ट करने के लिए खेत की जुताई और जुताई करने की भी सलाह दी जाती है ताकि अन्य टंग्रो मेजबानों को नष्ट किया जा सके।
                    8. मेड़ों पर खरपतवार नाशकों का विनाश।

                    रासायनिक तरीके
                    •  मैंकोजेब में 2.5 ग्राम/लीटर यूरिया मिलाकर 2% यूरिया का छिड़काव करके पत्तियों के पीलेपन को कम किया जा सकता है।
                    • यूरिया के बजाय मल्टी-के (पोटेशियम नाइट्रेट) जैसे पत्तेदार उर्वरक का 1 प्रतिशत छिड़काव किया जा सकता है जो उच्च पोटेशियम सामग्री के कारण प्रतिरोध भी प्रदान करता है।
                    • रोगवाहक के रूप में हरी पत्ती हॉपर को समय पर छिड़काव द्वारा प्रभावी ढंग से नियंत्रित किया जाना है।
                    • रोपाई के 15 और 30 दिन बाद दो बार कीटनाशकों का छिड़काव करें

                    निम्नलिखित कीटनाशकों में से किसी एक का दो बार छिड़काव करें
                    मोनोक्रोटोफॉस 36 डब्ल्यूएससी (40 मिली/हे.)
                    फेन्थियन 100 ईसी (40 मिली/हेक्टेयर) का छिड़काव रोपाई के 15 और 30 दिन बाद किया जा सकता है।


                    अधिक जानकारी के लिए देखें https://farmer.gov.in/FarmerHome.aspx

                    या किसान कॉल सेंटर (केसीसी) से संपर्क करें (टोल फ्री नंबर 1800-180-1551) """);
        } else if (disease.equalsIgnoreCase("Tungro")) {
            remedy.setText("""
                    जाल विधियाँ:
                                        
                    लीफ हॉपर वैक्टर को आकर्षित करने और नियंत्रित करने के साथ-साथ आबादी की निगरानी के लिए लाइट ट्रैप स्थापित किए जाने हैं।
                    प्रात:काल प्रकाश ट्रैप के पास उतरते हुए लीफहॉपर की आबादी को कीटनाशकों के छिड़काव/धूल से मार देना चाहिए। इसका अभ्यास प्रतिदिन करना चाहिए।
                    सांस्कृतिक तरीके:

                    टुंग्रो वायरस रोग के खिलाफ प्रतिरोधी किस्मों का रोपण रोग के प्रबंधन का सबसे किफायती साधन है।
                    प्रतिरोधी किस्मों जैसे IR 36, IR 50, ADT 37, Ponmani, Co 45, Co 48, सुरेखा, विक्रमरी, भरणी, IR 36 और सफेद पोनी का प्रयोग करें।
                    सांस्कृतिक प्रबंधन प्रथाओं के बीच, रोपण की तारीख को समायोजित करने की सिफारिश की जाती है।
                     इसी तरह, रोग के मेजबान और वायरस और वैक्टर को खत्म करने के लिए कम से कम एक महीने की परती अवधि का पालन करना।
                     महामारी क्षेत्रों में दलहन या तिलहन के साथ रोटेशन का पालन करें।
                    नीम केक @ 12.5 किग्रा/20 प्रतिशत नर्सरी बेसल खुराक के रूप में डालें।
                    फसल के तुरंत बाद ठूंठों को नष्ट करने के लिए खेत की जुताई और जुताई
                    अन्य टुंग्रो मेजबानों का उन्मूलन भी उचित है।
                    मेड़ों पर खरपतवार नाशकों का विनाश।
                    रासायनिक तरीके:

                    2.5 ग्राम प्रति लीटर की दर से मैनकोजेब के साथ मिश्रित 2% यूरिया का छिड़काव करके पत्ती के पीलेपन को कम किया जा सकता है।
                    यूरिया के बजाय मल्टी-के (पोटेशियम नाइट्रेट) जैसे पत्तेदार उर्वरक का 1 प्रतिशत छिड़काव किया जा सकता है जो उच्च पोटेशियम सामग्री के कारण रोग प्रतिरोधक क्षमता प्रदान करता है।
                    रोगवाहक के रूप में हरी पत्ती हॉपर को समय पर छिड़काव द्वारा प्रभावी ढंग से नियंत्रित किया जाना है।
                    मेड़ों पर सब्जियों का भी कीटनाशकों का छिड़काव करना चाहिए। नर्सरी में 2.5 सेमी पानी बनाए रखें और निम्नलिखित में से किसी को भी 20 सेंट कार्बोफुरन 3 जी 3.5 किग्रा (या) फोरेट 10 जी 1.0 किग्रा (या) क्विनलफॉस 5 जी 2.0 किग्रा में प्रसारित करें।
                    नर्सरी में जब वायरस का संक्रमण कम हो, तो वेक्टर आबादी को नियंत्रित करने के लिए कार्बोफ्यूरन ग्रेन्यूल्स @ 1 किग्रा/हेक्टेयर लगाएं।
                    जुताई से पहले से मध्य जुताई के दौरान जब एक प्रभावित पहाड़ी/मीटर देखा जाता है तो कीट वेक्टर को नियंत्रित करने के लिए 3.5 किग्रा/हेक्टेयर की दर से कार्बोफुरन दानों का प्रयोग शुरू करें।
                    निम्नलिखित कीटनाशकों में से किसी एक का दो बार छिड़काव करें
                    थियामेथोक्सम 25 डब्ल्यूडीजी 100 ग्राम/हेक्टेयर (या)
                    रोपाई के 15 और 30 दिन बाद इमिडाक्लोप्रिड 17.8 एसएल 100 मि.ली./हेक्टेयर। मेड़ों की वनस्पति पर भी कीटनाशकों का छिड़काव करना चाहिए।
                        
                    अधिक जानकारी के लिए देखें https://farmer.gov.in/FarmerHome.aspx
                        
                        
                    या किसान कॉल सेंटर (केसीसी) से संपर्क करें (टोल फ्री नंबर 1800-180-1551) """);
        } else {
            remedy.setText("आपके पास स्वस्थ फसल है");
        }
        remedy.setChatId(chatId);
        return remedy;
    }

    public SendMessage wheatDiseaseRemedy(String disease, Long chatId) {
        SendMessage remedy = new SendMessage();
        if (disease.equalsIgnoreCase("LEAF RUST") || disease.equalsIgnoreCase("STEM RUST") || disease.equalsIgnoreCase("YELLOW RUST")) {
            remedy.setText("""
                    जंग के नियंत्रण के लिए सबसे प्रभावी तरीका, जंग प्रतिरोधी किस्मों को उगाना है।
                    गेहूं की किस्मों के बीच जैव विविधता भी जंग की समस्या को प्रभावी ढंग से रोक सकती है।
                    प्रत्येक खेत में एक बार में 3-4 गेहूं की किस्मों का प्रयोग करें। देर से बुवाई या देर से करने से बचें
                    परिपक्व किस्में। फसल को जंग के संक्रमण से बचाने के लिए 5 लीटर का छिड़काव करें
                    खट्टा छाछ 200 लीटर पानी में मिलाया जाता है। अमरनाथ (चौलाई या लाल भाजी -
                    एक आम हरी पत्ती वाली सब्जी) या मेंथा (पुदीना) की पत्ती की धूल का भी इस्तेमाल किया जा सकता है
                    संक्रमण को रोकने के लिए बारीक स्प्रे (25- 30 ग्राम सूखे पत्तों का पाउडर प्रति लीटर पानी)
                    जंग का। हिबिस्कस रोजा-सिनेंसिस (चीन) के सूखे पत्तों के अर्क का पर्ण स्प्रे
                    गुलाब) जंग के संक्रमण को भी रोक सकता है।


                    अधिक जानकारी के लिए देखें https://farmer.gov.in/FarmerHome.aspx


                    या किसान कॉल सेंटर (केसीसी) से संपर्क करें (टोल फ्री नंबर 1800-180-1551) """);

        } else if (disease.equalsIgnoreCase("POWDERY MILDEW")) {
            remedy.setText("""
                    1. रोगों के लिए प्रतिरोधी किस्मों को उगाएं।
                    2. फसल खत्म होने के बाद खेत में बुम फसल का कचरा।
                    3. यदि नुकसान अधिक होने की आशंका हो तो डाइथेन एम-45 और . के मिश्रण का छिड़काव करें
                    कराठाणे को लाभकारी पाया गया है। के 16 भाग मिलाकर मिश्रण तैयार करें
                    डाइथेन एम-45 और कराथेन-25 वेटेबल पाउडर के 4 भाग। स्प्रे मिश्रण @ 2
                    किलो/हेक्टेयर 1000 लीटर पानी में घोला गया। लगभग तीन स्प्रे पर्याप्त होंगे
                    10-15 दिनों के अंतराल पर। विभिन्न स्प्रे के लिए पानी की मात्रा हो सकती है
                    फसल की बढ़ती अवस्था के आधार पर निर्णय लिया जाता है।


                    अधिक जानकारी के लिए देखें https://farmer.gov.in/FarmerHome.aspx


                    या किसान कॉल सेंटर (केसीसी) से संपर्क करें (टोल फ्री नंबर 1800-180-1551) """);
        } else if (disease.equalsIgnoreCase("SEPTORIA")) {
            remedy.setText("""
                    उच्च सेप्टोरिया ट्रिटिक प्रतिरोध रेटिंग के साथ एक किस्म उगाएं
                    शुरुआती ड्रिलिंग से बचें, विशेष रूप से अतिसंवेदनशील किस्मों की
                    T2 कवकनाशी का समय सबसे महत्वपूर्ण है, T1 के साथ सेप्टोरिया ट्रिटिक नियंत्रण पर भी लक्षित है। हालांकि, T0 स्प्रे शायद ही कभी उपज लाभ देता है
                    एक मल्टीसाइट (जहां संभव हो) के साथ एज़ोल के संतुलित मिश्रण का उपयोग करें। एक SDHI तभी जोड़ें जब बीमारी का जोखिम इसके लायक हो
                    आवश्यक नियंत्रण प्राप्त करने के लिए संभव न्यूनतम खुराक का उपयोग करें, लेकिन सुनिश्चित करें कि मिश्रण का प्रत्येक घटक नियंत्रण के तुलनीय स्तर देता है


                    अधिक जानकारी के लिए देखें https://farmer.gov.in/FarmerHome.aspx
                    %0ए% 0ए
                    या किसान कॉल सेंटर (केसीसी) से संपर्क करें (टोल फ्री नंबर 1800-180-1551) """);
        } else if (disease.equalsIgnoreCase("SEEDLING")) {
            remedy.setText("कोई उपाय उपलब्ध नहीं");
        } else {
            remedy.setText("आपके पास स्वस्थ फसल है");
        }
        remedy.setChatId(chatId);
        return remedy;
    }
}
