package com.thapar.CropSaviour.Service;

import org.jvnet.hk2.annotations.Service;
import org.telegram.telegrambots.meta.api.methods.send.SendMessage;

@Service
public class PunjabiRemedyService {
    public SendMessage riceDiseaseRemedy(String disease, Long chatId) {
        SendMessage remedy = new SendMessage();
        if (disease.equalsIgnoreCase("Bacterial Blight")) {
            remedy.setText("""
                    ਬੈਕਟੀਰੀਅਲ ਬਲਾਈਟ ਉਪਚਾਰ
                                                                                    
                    ਰੋਕਥਾਮ ਵਿਧੀ
                    1. ਬਲੀਚਿੰਗ ਪਾਊਡਰ (100 ਗ੍ਰਾਮ/ਲੀ) ਅਤੇ ਜ਼ਿੰਕ ਸਲਫੇਟ (2%) ਨਾਲ ਬੀਜ ਦਾ ਇਲਾਜ ਬੈਕਟੀਰੀਆ ਦੇ ਝੁਲਸ ਨੂੰ ਘਟਾਉਂਦਾ ਹੈ।
                    2. ਬੀਜ ਦਾ ਇਲਾਜ - ਬੀਜ ਨੂੰ 8 ਘੰਟੇ ਲਈ ਐਗਰੀਮਾਈਸਿਨ (0.025%) ਅਤੇ ਗਿੱਲੇ ਹੋਣ ਯੋਗ ਸੇਰੇਸਨ (0.05%) ਵਿੱਚ ਭਿੱਜਣਾ ਅਤੇ 52-54 ਡਿਗਰੀ ਸੈਲਸੀਅਸ ਤਾਪਮਾਨ 'ਤੇ 30 ਮਿੰਟ ਲਈ ਗਰਮ ਪਾਣੀ ਦੇ ਇਲਾਜ ਦੁਆਰਾ;
                    3. ਬੀਜ ਨੂੰ ਸੇਰੇਸਨ (0.1%) ਵਿੱਚ 8 ਘੰਟਿਆਂ ਲਈ ਭਿਉਂ ਕੇ ਰੱਖੋ ਅਤੇ ਸਟ੍ਰੈਪਟੋਸਾਈਕਲਿਨ (1 ਲੀਟਰ ਵਿੱਚ 3 ਗ੍ਰਾਮ);
                    4. ਨਿੰਮ ਦਾ ਤੇਲ 3% ਜਾਂ NSKE 5% ਦਾ ਛਿੜਕਾਅ ਕਰੋ।
                    5. ਬੈਕਟੀਰੀਆ ਦੇ ਝੁਲਸ ਦੇ ਨਿਯੰਤਰਣ ਲਈ ਤਾਜ਼ੇ ਗੋਹੇ ਦੇ ਐਬਸਟਰੈਕਟ ਦਾ ਛਿੜਕਾਅ ਕਰੋ। 20 ਗ੍ਰਾਮ ਗੋਬਰ ਨੂੰ ਇੱਕ ਲੀਟਰ ਪਾਣੀ ਵਿੱਚ ਘੋਲੋ; ਸੈਟਲ ਕਰਨ ਅਤੇ ਛਾਲਣ ਦੀ ਆਗਿਆ ਦਿਓ. ਸੁਪਰਨੇਟੈਂਟ ਤਰਲ ਦੀ ਵਰਤੋਂ ਕਰੋ। (ਬਿਮਾਰੀ ਦੀ ਸ਼ੁਰੂਆਤੀ ਦਿੱਖ ਤੋਂ ਸ਼ੁਰੂ ਹੋ ਕੇ ਅਤੇ ਪੰਦਰਵਾੜੇ ਦੇ ਅੰਤਰਾਲ 'ਤੇ ਦੂਜਾ)
                    ਸੱਭਿਆਚਾਰਕ ਢੰਗ
                    1. ਨਰਸਰੀਆਂ ਨੂੰ ਤਰਜੀਹੀ ਤੌਰ 'ਤੇ ਅਲੱਗ-ਥਲੱਗ ਪਹਾੜੀ ਸਥਿਤੀਆਂ ਵਿੱਚ ਵਧਾਓ
                    2. ਟਰਾਂਸਪਲਾਂਟਿੰਗ ਦੌਰਾਨ ਬੂਟਿਆਂ ਨੂੰ ਕੱਟਣ ਤੋਂ ਬਚੋ।
                    3. ਖੇਤ ਦਾ ਨਿਕਾਸ ਕਰੋ (ਫਸਲ ਦੇ ਫੁੱਲਾਂ ਦੇ ਪੜਾਅ ਨੂੰ ਛੱਡ ਕੇ)
                    4. ਜੰਗਲੀ ਬੂਟੀ ਅਤੇ ਜਮਾਂਦਰੂ ਮੇਜ਼ਬਾਨਾਂ ਦਾ ਵਿਨਾਸ਼
                    5. ਪ੍ਰਭਾਵਿਤ ਖੇਤਾਂ ਤੋਂ ਪਾਣੀ ਦੇ ਵਹਾਅ ਤੋਂ ਬਚੋ
                    6. ਪੌਦਿਆਂ ਦੀ ਉਚਿਤ ਵਿੱਥ ਬਣਾਈ ਰੱਖੋ
                        
                        
                    ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ https://farmer.gov.in/FarmerHome.aspx 'ਤੇ ਜਾਓ
                        
                    ਜਾਂ ਕਿਸਾਨ ਕਾਲ ਸੈਂਟਰ (ਕੇਸੀਸੀ) ਨਾਲ ਸੰਪਰਕ ਕਰੋ (ਟੋਲ ਫ੍ਰੀ ਨੰਬਰ 1800-180-1551) """);
        } else if (disease.equalsIgnoreCase("Blast") || disease.equalsIgnoreCase("Leaf Blast")) {
            remedy.setText("""
                    ਧਮਾਕੇ ਦੇ ਉਪਚਾਰ
                    ਰੋਕਥਾਮ ਉਪਾਅ
                    1. ਸਿਹਤਮੰਦ ਜਾਂ ਪ੍ਰਮਾਣਿਤ ਬੀਜ ਸਮੱਗਰੀ ਦੀ ਵਰਤੋਂ ਕਰੋ।
                    2. ਖੇਤਰ ਵਿੱਚ ਉਪਲਬਧ ਰੋਧਕ ਕਿਸਮਾਂ ਬੀਜੋ।
                    3. ਬਰਸਾਤੀ ਮੌਸਮ ਸ਼ੁਰੂ ਹੋਣ ਤੋਂ ਬਾਅਦ ਸੀਜ਼ਨ ਦੇ ਸ਼ੁਰੂ ਵਿੱਚ ਬੀਜ ਬੀਜੋ।
                    4. ਬਹੁਤ ਜ਼ਿਆਦਾ ਨਾਈਟ੍ਰੋਜਨ ਖਾਦ ਪਾਉਣ ਤੋਂ ਬਚੋ ਅਤੇ ਐਪਲੀਕੇਸ਼ਨਾਂ ਨੂੰ ਦੋ ਹਿੱਸਿਆਂ ਵਿੱਚ ਵੰਡੋ
                    ਜਾਂ ਹੋਰ ਇਲਾਜ।
                    5. ਨਿਯਮਤ ਸਿੰਚਾਈ ਨਾਲ ਪੌਦਿਆਂ ਨੂੰ ਸੋਕੇ ਦੇ ਤਣਾਅ ਤੋਂ ਬਚੋ।
                    6. ਚੌਲਾਂ ਨੂੰ ਸਹੀ ਢੰਗ ਨਾਲ ਵਧਣ ਲਈ ਇੱਕ ਸਹੀ ਫਲੱਡ ਪੱਧਰ ਰੱਖੋ।
                    7. ਲਗਾਤਾਰ ਹੜ੍ਹਾਂ ਨੂੰ ਬਣਾਈ ਰੱਖੋ ਅਤੇ ਚੌਲਾਂ ਦੇ ਖੇਤ ਦੇ ਨਿਕਾਸ ਤੋਂ ਬਚੋ।
                    8. ਨਦੀਨਾਂ ਅਤੇ ਵਿਕਲਪਕ ਮੇਜ਼ਬਾਨਾਂ ਦਾ ਨਿਯੰਤਰਣ ਬਣਾਈ ਰੱਖੋ।
                    9. ਜੇਕਰ ਮਿੱਟੀ ਵਿੱਚ ਸਿਲੀਕਾਨ ਦੀ ਘਾਟ ਹੋਣ ਦਾ ਪਤਾ ਲੱਗਦਾ ਹੈ ਤਾਂ ਸਿਲੀਕਾਨ ਖਾਦ ਪਾਓ।
                    10. ਸਿਲੀਕਾਨ ਦੇ ਸਸਤੇ ਸਰੋਤਾਂ ਵਿੱਚ ਉੱਚੇ ਦੇ ਨਾਲ ਚੌਲਾਂ ਦੀਆਂ ਕਿਸਮਾਂ ਦੀਆਂ ਤੂੜੀਆਂ ਸ਼ਾਮਲ ਹਨ
                    ਸਿਲੀਕਾਨ ਸਮੱਗਰੀ.
                    11. ਲੱਛਣਾਂ ਲਈ ਨਿਯਮਿਤ ਤੌਰ 'ਤੇ ਆਪਣੇ ਖੇਤ ਦੀ ਨਿਗਰਾਨੀ ਕਰੋ।
                    12. ਉੱਲੀ ਦੇ ਵਧਣ ਤੋਂ ਰੋਕਣ ਲਈ ਸਾਰੇ ਸੰਕਰਮਿਤ ਪੌਦਿਆਂ ਦੀ ਰਹਿੰਦ-ਖੂੰਹਦ ਨੂੰ ਨਸ਼ਟ ਕਰੋ
                    ਖੇਤਰ ਵਿਚ.
                    13. ਜਨਸੰਖਿਆ ਨੂੰ ਘਟਾਉਣ ਦੇ ਇੱਕ ਸਰਲ ਅਤੇ ਪ੍ਰਭਾਵੀ ਤਰੀਕੇ ਵਜੋਂ ਫਸਲੀ ਚੱਕਰ ਦੀ ਯੋਜਨਾ ਬਣਾਓ।


                    ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ https://farmer.gov.in/FarmerHome.aspx 'ਤੇ ਜਾਓ

                    ਜਾਂ ਕਿਸਾਨ ਕਾਲ ਸੈਂਟਰ (ਕੇਸੀਸੀ) ਨਾਲ ਸੰਪਰਕ ਕਰੋ (ਟੋਲ ਫ੍ਰੀ ਨੰਬਰ 1800-180-1551)""");
        } else if (disease.equalsIgnoreCase("Brownspot")) {

            remedy.setText("""
                                        
                    ਬਰਾਊਨ ਸਪਾਟ ਦੇ ਉਪਚਾਰ
                                                                                                      
                    ਸੱਭਿਆਚਾਰਕ ਢੰਗ
                    1. ਕਿਉਂਕਿ ਬਿਮਾਰੀ ਬੀਜ ਪੈਦਾ ਹੁੰਦੀ ਹੈ, ਬਿਮਾਰੀ ਰਹਿਤ ਬੀਜਾਂ ਦੀ ਵਰਤੋਂ ਕਰੋ।
                    2. ਵਿਕਲਪਿਕ ਅਤੇ ਜਮਾਂਦਰੂ ਮੇਜ਼ਬਾਨਾਂ ਨੂੰ ਹਟਾਉਣਾ।
                    3. ਰੋਧਕ ਕਿਸਮਾਂ ਦੀ ਵਰਤੋਂ ਕੰਟਰੋਲ ਦਾ ਸਭ ਤੋਂ ਵੱਧ ਕਿਫ਼ਾਇਤੀ ਸਾਧਨ ਹੈ।
                    4. ADT 44, PY 4, CORH 1, CO 44, ਕਾਵੇਰੀ, ਭਵਾਨੀ, TPS 4 ਅਤੇ ਧਨੂ ਵਰਗੀਆਂ ਵਧਣ ਵਾਲੀਆਂ ਰੋਧਕ ਕਿਸਮਾਂ।
                    5. ਪੌਦਿਆਂ ਦੇ ਸਰਵੋਤਮ ਵਿਕਾਸ ਲਈ ਸਹੀ ਪੋਸ਼ਣ ਪ੍ਰਦਾਨ ਕਰਨਾ ਅਤੇ ਪਾਣੀ ਦੇ ਤਣਾਅ ਦੀ ਰੋਕਥਾਮ ਭੂਰੇ ਧੱਬੇ ਨੂੰ ਕੰਟਰੋਲ ਕਰਨ ਲਈ ਸਭ ਤੋਂ ਮਹੱਤਵਪੂਰਨ ਕਾਰਕ ਜਾਪਦੇ ਹਨ।
                                                                                  
                    ਰੋਕਥਾਮ ਦੇ ਤਰੀਕੇ
                    1. ਸੂਡੋਮੋਨਾਸ ਫਲੋਰੋਸੈਨਸ @ 10 ਗ੍ਰਾਮ/ਕਿਲੋ ਬੀਜ ਨਾਲ ਬੀਜ ਦਾ ਇਲਾਜ ਕਰੋ ਅਤੇ ਇਸ ਤੋਂ ਬਾਅਦ 2.5 ਕਿਲੋਗ੍ਰਾਮ @ ਦੀ ਬਿਜਾਈ ਜਾਂ ਉਤਪਾਦ/ਹੈਕਟੇਅਰ 100 ਲੀਟਰ ਵਿੱਚ ਘੋਲ ਕੇ 30 ਮਿੰਟ ਲਈ ਡੁਬੋ ਕੇ ਕਰੋ।
                    2. ਬੀਜ ਨੂੰ 2.0 ਗ੍ਰਾਮ / ਕਿਲੋ ਬੀਜ ਦੇ ਹਿਸਾਬ ਨਾਲ ਕੈਪਟਾਨ ਜਾਂ ਥੀਰਮ ਨਾਲ ਭਿਓ / ਬੀਜ ਦਾ ਇਲਾਜ ਕਰੋ।
                    3.ਕਿਉਂਕਿ ਉੱਲੀ ਦਾ ਬੀਜ ਪ੍ਰਸਾਰਿਤ ਹੁੰਦਾ ਹੈ, ਬਿਜਾਈ ਤੋਂ ਪਹਿਲਾਂ 10-12 ਮਿੰਟਾਂ ਲਈ ਗਰਮ ਪਾਣੀ ਦਾ ਬੀਜ ਇਲਾਜ (53-54°C) ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਹੋ ਸਕਦਾ ਹੈ। ਇਹ ਇਲਾਜ ਬੀਜ ਦੇ ਪੜਾਅ 'ਤੇ ਪ੍ਰਾਇਮਰੀ ਲਾਗ ਨੂੰ ਕੰਟਰੋਲ ਕਰਦਾ ਹੈ। ਬੀਜ ਨੂੰ 8 ਘੰਟਿਆਂ ਲਈ ਠੰਡੇ ਪਾਣੀ ਵਿੱਚ ਭਿਉਂ ਕੇ ਰੱਖਣ ਨਾਲ ਇਲਾਜ ਦੀ ਪ੍ਰਭਾਵਸ਼ੀਲਤਾ ਵਧ ਜਾਂਦੀ ਹੈ।
                                                                                  
                                                                                  
                    ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ https://farmer.gov.in/FarmerHome.aspx 'ਤੇ ਜਾਓ
                                                                                  
                    ਜਾਂ ਕਿਸਾਨ ਕਾਲ ਸੈਂਟਰ (ਕੇਸੀਸੀ) ਨਾਲ ਸੰਪਰਕ ਕਰੋ (ਟੋਲ ਫ੍ਰੀ ਨੰਬਰ 1800-180-1551)""");

        } else if (disease.equalsIgnoreCase("Hispa")) {
            remedy.setText("""
                    1. ਖੇਤ ਨੂੰ ਜ਼ਿਆਦਾ ਖਾਦ ਪਾਉਣ ਤੋਂ ਬਚੋ।
                    2. ਪੌਦਿਆਂ ਦੀ ਦੂਰੀ ਨੂੰ ਬੰਦ ਕਰਨ ਨਾਲ ਪੱਤਿਆਂ ਦੀ ਘਣਤਾ ਵੱਧ ਜਾਂਦੀ ਹੈ ਜੋ ਉੱਚ ਹਿਸਪਾ ਸੰਖਿਆਵਾਂ ਨੂੰ ਬਰਦਾਸ਼ਤ ਕਰ ਸਕਦੀ ਹੈ।
                    3. ਪੱਤੇ ਦੀ ਨੋਕ ਜਿਸ ਵਿੱਚ ਧੱਬੇ ਵਾਲੀਆਂ ਖਾਣਾਂ ਹਨ ਨੂੰ ਨਸ਼ਟ ਕਰ ਦੇਣਾ ਚਾਹੀਦਾ ਹੈ।
                    4. ਬੀਟਲਾਂ ਨੂੰ ਹੱਥੀਂ ਇਕੱਠਾ ਕਰਨਾ ਅਤੇ ਮਾਰਨਾ - ਹੱਥ ਜਾਲ।
                    5. ਕੀੜਿਆਂ ਦੇ ਅੰਡੇ ਦੇਣ ਤੋਂ ਰੋਕਣ ਲਈ, ਸ਼ੂਟ ਟਿਪਸ ਨੂੰ ਕੱਟਿਆ ਜਾ ਸਕਦਾ ਹੈ।
                    6. ਚਿੱਕੜ ਵਿੱਚ ਟਹਿਣੀਆਂ ਨੂੰ ਕਲਿਪ ਕਰਨ ਅਤੇ ਦੱਬਣ ਨਾਲ ਗਰਬ ਦੀ ਆਬਾਦੀ 75 - 92% ਘਟ ਸਕਦੀ ਹੈ।
                    7.Reduviid ਬੱਗ ਬਾਲਗਾਂ ਨੂੰ ਖਾਂਦਾ ਹੈ।
                    8. ਮਿਥਾਈਲ ਪੈਰਾਥੀਓਨ 0.05% ਜਾਂ ਕੁਇਨਲਫੋਸ 0.05% ਦਾ ਛਿੜਕਾਅ।
                    1. ਲੀਫ ਹਾਪਰ ਵੈਕਟਰਾਂ ਨੂੰ ਆਕਰਸ਼ਿਤ ਕਰਨ ਅਤੇ ਨਿਯੰਤਰਣ ਕਰਨ ਦੇ ਨਾਲ-ਨਾਲ ਆਬਾਦੀ ਦੀ ਨਿਗਰਾਨੀ ਕਰਨ ਲਈ ਲਾਈਟ ਟਰੈਪ ਲਗਾਏ ਜਾਣੇ ਹਨ।
                    2. ਸਵੇਰੇ-ਸਵੇਰੇ, ਲਾਈਟ ਟ੍ਰੈਪ ਦੇ ਨੇੜੇ ਡਿੱਗਣ ਵਾਲੇ ਲੀਫਹਾਪਰ ਦੀ ਆਬਾਦੀ ਨੂੰ ਕੀਟਨਾਸ਼ਕਾਂ ਦਾ ਛਿੜਕਾਅ/ਧੂੜ ਪਾ ਕੇ ਮਾਰ ਦੇਣਾ ਚਾਹੀਦਾ ਹੈ।
                    3.ਇਹ ਹਰ ਰੋਜ਼ ਅਭਿਆਸ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ।

                    ਸੱਭਿਆਚਾਰਕ ਢੰਗ
                    1. ਤੁੰਗਰੋ ਵਾਇਰਸ ਰੋਗ ਦੇ ਵਿਰੁੱਧ ਰੋਧਕ ਕਿਸਮਾਂ ਦੀ ਬਿਜਾਈ ਕਰਨਾ ਬਿਮਾਰੀ ਦੇ ਪ੍ਰਬੰਧਨ ਦਾ ਸਭ ਤੋਂ ਵੱਧ ਕਿਫ਼ਾਇਤੀ ਸਾਧਨ ਹੈ।
                    2. ਰੋਧਕ ਕਿਸਮਾਂ ਜਿਵੇਂ ਕਿ IR 36, IR 50, ADT 37, Ponmani, Co 45, Co 48, Surekha, Vikramarya, Bharani, IR 36 ਅਤੇ ਚਿੱਟੀ ਪੋਨੀ ਦੀ ਵਰਤੋਂ ਕਰੋ।
                    3. ਸੱਭਿਆਚਾਰਕ ਪ੍ਰਬੰਧਨ ਅਭਿਆਸਾਂ ਵਿੱਚ, ਲਾਉਣਾ ਦੀ ਮਿਤੀ ਨੂੰ ਅਨੁਕੂਲ ਕਰਨ ਦੀ ਸਿਫਾਰਸ਼ ਕੀਤੀ ਜਾਂਦੀ ਹੈ।
                    4. ਇਸੇ ਤਰ੍ਹਾਂ, ਬਿਮਾਰੀ ਦੇ ਮੇਜ਼ਬਾਨਾਂ ਅਤੇ ਵਾਇਰਸਾਂ ਅਤੇ ਵੈਕਟਰਾਂ ਨੂੰ ਖਤਮ ਕਰਨ ਲਈ ਘੱਟੋ-ਘੱਟ ਇੱਕ ਮਹੀਨੇ ਦੀ ਪਤਝੜ ਦੀ ਮਿਆਦ ਦਾ ਪਾਲਣ ਕਰਨਾ।
                    5. ਮਹਾਂਮਾਰੀ ਵਾਲੇ ਖੇਤਰਾਂ ਵਿੱਚ ਦਾਲਾਂ ਜਾਂ ਤੇਲ ਬੀਜਾਂ ਨਾਲ ਘੁੰਮਾਓ।
                    6. ਨਿੰਮ ਦਾ ਕੇਕ @ 12.5 ਕਿਲੋਗ੍ਰਾਮ/20 ਸੈਂਟੀ ਨਰਸਰੀ ਨੂੰ ਮੂਲ ਖੁਰਾਕ ਵਜੋਂ ਲਾਗੂ ਕਰੋ।
                    7. ਵਾਢੀ ਤੋਂ ਤੁਰੰਤ ਬਾਅਦ ਪਰਾਲੀ ਨੂੰ ਨਸ਼ਟ ਕਰਨ ਲਈ ਖੇਤ ਨੂੰ ਵਾਹੁਣ ਅਤੇ ਕਟਾਈ ਕਰਨ ਦੀ ਸਲਾਹ ਦਿੱਤੀ ਜਾਂਦੀ ਹੈ ਤਾਂ ਜੋ ਹੋਰ ਟੰਗਰੋ ਮੇਜ਼ਬਾਨਾਂ ਨੂੰ ਖਤਮ ਕੀਤਾ ਜਾ ਸਕੇ।
                    8. ਬੰਨ੍ਹਾਂ 'ਤੇ ਨਦੀਨਾਂ ਦੇ ਮੇਜ਼ਬਾਨਾਂ ਦਾ ਨਾਸ਼।

                    ਰਸਾਇਣਕ ਢੰਗ
                    • ਪੱਤਿਆਂ ਦੇ ਪੀਲੇ ਹੋਣ ਨੂੰ ਮੈਨਕੋਜ਼ੇਬ ਨਾਲ 2% ਯੂਰੀਆ ਮਿਲਾ ਕੇ 2.5 ਗ੍ਰਾਮ ਪ੍ਰਤੀ ਲਿਟਰ ਦੇ ਹਿਸਾਬ ਨਾਲ ਛਿੜਕਾਅ ਕਰਕੇ ਘੱਟ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ।
                    • ਯੂਰੀਆ ਦੀ ਥਾਂ 'ਤੇ ਮਲਟੀ-ਕੇ (ਪੋਟਾਸ਼ੀਅਮ ਨਾਈਟ੍ਰੇਟ) ਵਰਗੀ ਖਾਦ ਦਾ 1 ਫੀਸਦੀ ਛਿੜਕਾਅ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ ਜੋ ਪੋਟਾਸ਼ੀਅਮ ਦੀ ਜ਼ਿਆਦਾ ਮਾਤਰਾ ਹੋਣ ਕਾਰਨ ਪ੍ਰਤੀਰੋਧ ਵੀ ਪ੍ਰਦਾਨ ਕਰਦਾ ਹੈ।
                    • ਵੈਕਟਰ ਦੇ ਤੌਰ 'ਤੇ ਹਰੇ ਪੱਤੇ ਹਾਪਰਾਂ ਨੂੰ ਸਮੇਂ ਸਿਰ ਸਪਰੇਅ ਕਰਕੇ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਢੰਗ ਨਾਲ ਨਿਯੰਤਰਿਤ ਕੀਤਾ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ।
                    • ਕੀਟਨਾਸ਼ਕਾਂ ਦਾ ਛਿੜਕਾਅ ਦੋ ਵਾਰ, 15 ਅਤੇ 30 ਦਿਨ ਬਾਅਦ ਕਰੋ

                    ਹੇਠਾਂ ਦਿੱਤੇ ਕੀਟਨਾਸ਼ਕਾਂ ਵਿੱਚੋਂ ਕਿਸੇ ਇੱਕ ਦੇ ਦੋ ਰਾਊਂਡ ਸਪਰੇਅ ਕਰੋ
                    ◦ ਮੋਨੋਕਰੋਟੋਫੋਸ 36 WSC (40 ml/ha)
                    ◦ ਫੈਂਥੀਓਨ 100 ਈਸੀ (40 ਮਿਲੀਲੀਟਰ/ਹੈਕਟੇਅਰ) ਦਾ ਛਿੜਕਾਅ ਬਿਜਾਈ ਤੋਂ 15 ਅਤੇ 30 ਦਿਨਾਂ ਬਾਅਦ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ।


                    ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ https://farmer.gov.in/FarmerHome.aspx 'ਤੇ ਜਾਓ

                    ਜਾਂ ਕਿਸਾਨ ਕਾਲ ਸੈਂਟਰ (ਕੇਸੀਸੀ) ਨਾਲ ਸੰਪਰਕ ਕਰੋ (ਟੋਲ ਫ੍ਰੀ ਨੰਬਰ 1800-180-1551) """);
        } else if (disease.equalsIgnoreCase("Tungro")) {
            remedy.setText("""
                    ਜਾਲ ਦੇ ਤਰੀਕੇ:

                    ਲੀਫ ਹੌਪਰ ਵੈਕਟਰਾਂ ਨੂੰ ਆਕਰਸ਼ਿਤ ਕਰਨ ਅਤੇ ਨਿਯੰਤਰਣ ਕਰਨ ਦੇ ਨਾਲ-ਨਾਲ ਆਬਾਦੀ ਦੀ ਨਿਗਰਾਨੀ ਕਰਨ ਲਈ ਲਾਈਟ ਟਰੈਪ ਲਗਾਏ ਜਾਣੇ ਹਨ।
                    ਸਵੇਰੇ-ਸਵੇਰੇ, ਲਾਈਟ ਟ੍ਰੈਪ ਦੇ ਨੇੜੇ ਲੀਫਹਾਪਰ ਦੀ ਆਬਾਦੀ ਨੂੰ ਕੀਟਨਾਸ਼ਕਾਂ ਦਾ ਛਿੜਕਾਅ/ਧੂੜ ਪਾ ਕੇ ਮਾਰ ਦੇਣਾ ਚਾਹੀਦਾ ਹੈ। ਇਹ ਹਰ ਰੋਜ਼ ਅਭਿਆਸ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ.
                    ਸੱਭਿਆਚਾਰਕ ਢੰਗ:

                    ਤੁੰਗਰੋ ਵਾਇਰਸ ਰੋਗ ਦੇ ਵਿਰੁੱਧ ਰੋਧਕ ਕਿਸਮਾਂ ਦੀ ਬਿਜਾਈ ਕਰਨਾ ਬਿਮਾਰੀ ਦੇ ਪ੍ਰਬੰਧਨ ਦਾ ਸਭ ਤੋਂ ਵੱਧ ਕਿਫ਼ਾਇਤੀ ਸਾਧਨ ਹੈ।
                    ਰੋਧਕ ਕਿਸਮਾਂ ਜਿਵੇਂ ਕਿ IR 36, IR 50, ADT 37, Ponmani, Co 45, Co 48, ਸੁਰੇਖਾ, ਵਿਕਰਮਰੀਆ, ਭਰਾਨੀ, IR 36 ਅਤੇ ਚਿੱਟੀ ਪੋਨੀ ਦੀ ਵਰਤੋਂ ਕਰੋ।
                    ਸੱਭਿਆਚਾਰਕ ਪ੍ਰਬੰਧਨ ਅਭਿਆਸਾਂ ਵਿੱਚ, ਲਾਉਣਾ ਦੀ ਮਿਤੀ ਨੂੰ ਅਨੁਕੂਲ ਕਰਨ ਦੀ ਸਿਫਾਰਸ਼ ਕੀਤੀ ਜਾਂਦੀ ਹੈ।
                    ਇਸੇ ਤਰ੍ਹਾਂ, ਬਿਮਾਰੀ ਦੇ ਮੇਜ਼ਬਾਨਾਂ ਅਤੇ ਵਾਇਰਸਾਂ ਅਤੇ ਵੈਕਟਰਾਂ ਨੂੰ ਖਤਮ ਕਰਨ ਲਈ ਘੱਟੋ-ਘੱਟ ਇੱਕ ਮਹੀਨੇ ਦੀ ਪਤਝੜ ਦੀ ਮਿਆਦ ਦਾ ਨਿਰੀਖਣ ਕਰਨਾ।
                    ਮਹਾਂਮਾਰੀ ਵਾਲੇ ਖੇਤਰਾਂ ਵਿੱਚ ਦਾਲਾਂ ਜਾਂ ਤੇਲ ਬੀਜਾਂ ਨਾਲ ਘੁੰਮਾਓ।
                    ਨਿੰਮ ਦਾ ਕੇਕ @ 12.5 ਕਿਲੋਗ੍ਰਾਮ/20 ਸੈਂਟੀ ਨਰਸਰੀ ਨੂੰ ਮੂਲ ਖੁਰਾਕ ਵਜੋਂ ਲਾਗੂ ਕਰੋ।
                    ਵਾਢੀ ਤੋਂ ਤੁਰੰਤ ਬਾਅਦ ਪਰਾਲੀ ਨੂੰ ਨਸ਼ਟ ਕਰਨ ਲਈ ਖੇਤ ਨੂੰ ਵਾਹੁਣਾ ਅਤੇ ਕਟਾਈ ਕਰਨਾ
                    ਹੋਰ ਟੁੰਗਰੋ ਮੇਜ਼ਬਾਨਾਂ ਦੇ ਖਾਤਮੇ ਦੀ ਵੀ ਸਲਾਹ ਦਿੱਤੀ ਜਾਂਦੀ ਹੈ।
                    ਬੰਨ੍ਹਾਂ 'ਤੇ ਨਦੀਨਾਂ ਦੇ ਮੇਜ਼ਬਾਨਾਂ ਦਾ ਵਿਨਾਸ਼।
                    ਰਸਾਇਣਕ ਢੰਗ:

                    ਮੈਨਕੋਜ਼ੇਬ ਨਾਲ 2% ਯੂਰੀਆ ਮਿਲਾ ਕੇ 2.5 ਗ੍ਰਾਮ ਪ੍ਰਤੀ ਲਿਟਰ ਦੇ ਹਿਸਾਬ ਨਾਲ ਛਿੜਕਾਅ ਕਰਕੇ ਪੱਤਿਆਂ ਦੇ ਪੀਲੇ ਹੋਣ ਨੂੰ ਘੱਟ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ।
                    ਯੂਰੀਆ ਦੀ ਥਾਂ 'ਤੇ ਮਲਟੀ-ਕੇ (ਪੋਟਾਸ਼ੀਅਮ ਨਾਈਟ੍ਰੇਟ) ਵਰਗੀ ਖਾਦ ਦਾ 1 ਫੀਸਦੀ ਛਿੜਕਾਅ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ ਜੋ ਪੋਟਾਸ਼ੀਅਮ ਦੀ ਜ਼ਿਆਦਾ ਮਾਤਰਾ ਕਾਰਨ ਰੋਗ ਪ੍ਰਤੀਰੋਧਕ ਸ਼ਕਤੀ ਪ੍ਰਦਾਨ ਕਰਦਾ ਹੈ।
                    ਵੈਕਟਰ ਦੇ ਤੌਰ 'ਤੇ ਹਰੇ ਪੱਤੇ ਹਾਪਰਾਂ ਨੂੰ ਸਪਰੇਅ ਕਰਕੇ ਸਮੇਂ ਸਿਰ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਢੰਗ ਨਾਲ ਕੰਟਰੋਲ ਕੀਤਾ ਜਾਣਾ ਚਾਹੀਦਾ ਹੈ।
                    ਬੰਨ੍ਹਾਂ 'ਤੇ ਬਨਸਪਤੀ ਨੂੰ ਵੀ ਕੀਟਨਾਸ਼ਕਾਂ ਦਾ ਛਿੜਕਾਅ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ। ਨਰਸਰੀ ਵਿੱਚ 2.5 ਸੈਂਟੀਮੀਟਰ ਪਾਣੀ ਰੱਖੋ ਅਤੇ ਹੇਠਾਂ ਦਿੱਤੇ ਵਿੱਚੋਂ ਕਿਸੇ ਨੂੰ ਵੀ 20 ਸੈਂਟ ਕਾਰਬੋਫੁਰਾਨ 3 ਜੀ 3.5 ਕਿਲੋਗ੍ਰਾਮ (ਜਾਂ) ਫੋਰੇਟ 10 ਜੀ 1.0 ਕਿਲੋਗ੍ਰਾਮ (ਜਾਂ) ਕੁਇਨਲਫੋਸ 5 ਜੀ 2.0 ਕਿਲੋਗ੍ਰਾਮ ਵਿੱਚ ਪ੍ਰਸਾਰਿਤ ਕਰੋ।
                    ਨਰਸਰੀ ਵਿੱਚ ਜਦੋਂ ਵਾਇਰਸ ਦੀ ਲਾਗ ਘੱਟ ਹੁੰਦੀ ਹੈ, ਤਾਂ ਵੈਕਟਰ ਆਬਾਦੀ ਨੂੰ ਨਿਯੰਤਰਿਤ ਕਰਨ ਲਈ ਕਾਰਬੋਫੁਰਾਨ ਗ੍ਰੈਨਿਊਲ @ 1 ਕਿਲੋਗ੍ਰਾਮ ਪ੍ਰਤੀ ਹੈਕਟੇਅਰ ਲਾਗੂ ਕਰੋ।
                    ਪ੍ਰੀ-ਟਿਲਰਿੰਗ ਤੋਂ ਲੈ ਕੇ ਮੱਧ-ਟਿਲਰਿੰਗ ਦੌਰਾਨ ਜਦੋਂ ਇੱਕ ਪ੍ਰਭਾਵਿਤ ਪਹਾੜੀ/ਮੀਟਰ ਦੇਖਿਆ ਜਾਂਦਾ ਹੈ ਤਾਂ ਕੀਟ ਵੈਕਟਰ ਨੂੰ ਨਿਯੰਤਰਿਤ ਕਰਨ ਲਈ ਕਾਰਬੋਫੁਰਾਨ ਗ੍ਰੈਨਿਊਲ @ 3.5 ਕਿਲੋਗ੍ਰਾਮ ਪ੍ਰਤੀ ਹੈਕਟੇਅਰ ਦੀ ਵਰਤੋਂ ਸ਼ੁਰੂ ਕਰੋ।
                    ਹੇਠਾਂ ਦਿੱਤੇ ਕੀਟਨਾਸ਼ਕਾਂ ਵਿੱਚੋਂ ਕਿਸੇ ਇੱਕ ਦੇ ਦੋ ਰਾਊਂਡ ਸਪਰੇਅ ਕਰੋ
                    ਥਿਆਮੇਥੋਕਸਮ 25 ਡਬਲਯੂਡੀਜੀ 100 ਗ੍ਰਾਮ / ਹੈਕਟੇਅਰ (ਜਾਂ)
                    ਇਮੀਡਾਕਲੋਪ੍ਰਿਡ 17.8 SL 100 ਮਿ.ਲੀ./ਹੈਕਟੇਅਰ 15 ਅਤੇ 30 ਦਿਨਾਂ ਬਾਅਦ ਬੀਜੋ। ਬੰਨ੍ਹਾਂ 'ਤੇ ਲੱਗੀ ਬਨਸਪਤੀ 'ਤੇ ਵੀ ਕੀਟਨਾਸ਼ਕਾਂ ਦਾ ਛਿੜਕਾਅ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ।

                    ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ https://farmer.gov.in/FarmerHome.aspx 'ਤੇ ਜਾਓ


                    ਜਾਂ ਕਿਸਾਨ ਕਾਲ ਸੈਂਟਰ (ਕੇਸੀਸੀ) ਨਾਲ ਸੰਪਰਕ ਕਰੋ (ਟੋਲ ਫ੍ਰੀ ਨੰਬਰ 1800-180-1551) """);
        } else {
            remedy.setText("ਤੁਹਾਡੇ ਕੋਲ ਸਿਹਤਮੰਦ ਫਸਲ ਹੈ");
        }
        remedy.setChatId(chatId);
        return remedy;
    }

    public SendMessage wheatDiseaseRemedy(String disease, Long chatId) {
        SendMessage remedy = new SendMessage();
        if (disease.equalsIgnoreCase("LEAF RUST") || disease.equalsIgnoreCase("STEM RUST") || disease.equalsIgnoreCase("YELLOW RUST")) {
            remedy.setText("""
                    ਜੰਗਾਲ ਦੇ ਨਿਯੰਤਰਣ ਲਈ ਸਭ ਤੋਂ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਤਰੀਕਾ, ਜੰਗਾਲ-ਰੋਧਕ ਕਿਸਮਾਂ ਨੂੰ ਉਗਾਉਣਾ ਹੈ।
                    ਕਣਕ ਦੀਆਂ ਕਿਸਮਾਂ ਵਿੱਚ ਜੈਵ ਵਿਭਿੰਨਤਾ ਵੀ ਜੰਗਾਲ ਦੀ ਸਮੱਸਿਆ ਨੂੰ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਢੰਗ ਨਾਲ ਰੋਕ ਸਕਦੀ ਹੈ।
                    ਹਰੇਕ ਖੇਤ ਵਿੱਚ ਇੱਕ ਵਾਰ ਵਿੱਚ 3-4 ਕਣਕ ਦੀਆਂ ਕਿਸਮਾਂ ਦੀ ਵਰਤੋਂ ਕਰੋ। ਪਛੇਤੀ ਜਾਂ ਪਛੇਤੀ ਬਿਜਾਈ ਤੋਂ ਬਚੋ
                    ਪੱਕਣ ਵਾਲੀਆਂ ਕਿਸਮਾਂ. ਫਸਲ ਨੂੰ ਜੰਗਾਲ ਦੀ ਲਾਗ ਤੋਂ ਬਚਾਉਣ ਲਈ 5 ਲੀਟਰ ਦਾ ਛਿੜਕਾਅ ਕਰੋ
                    200 ਲੀਟਰ ਪਾਣੀ ਵਿੱਚ ਖੱਟੀ ਮੱਖਣ ਮਿਲਾਓ। ਅਮਰੰਥ (ਚੌਲਈ ਜਾਂ ਲਾਲ ਭਾਜੀ -
                    ਇੱਕ ਆਮ ਹਰੇ ਪੱਤੇ ਦੀ ਸਬਜ਼ੀ) ਜਾਂ ਮੈਂਥਾ (ਪੁਦੀਨਾ) ਪੱਤੇ ਦੀ ਧੂੜ ਨੂੰ ਵੀ ਵਰਤਿਆ ਜਾ ਸਕਦਾ ਹੈ
                    ਲਾਗ ਨੂੰ ਰੋਕਣ ਲਈ ਬਾਰੀਕ ਸਪਰੇਅ (25-30 ਗ੍ਰਾਮ ਸੁੱਕੇ ਪੱਤਿਆਂ ਦਾ ਪਾਊਡਰ ਪ੍ਰਤੀ ਲਿਟਰ ਪਾਣੀ)
                    ਜੰਗਾਲ ਦੇ. ਹਿਬਿਸਕਸ ਰੋਜ਼ਾ-ਸਿਨੇਨਸਿਸ (ਚੀਨ
                    ਗੁਲਾਬ) ਜੰਗਾਲ ਦੀ ਲਾਗ ਨੂੰ ਵੀ ਰੋਕ ਸਕਦਾ ਹੈ।


                    ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ https://farmer.gov.in/FarmerHome.aspx 'ਤੇ ਜਾਓ


                    ਜਾਂ ਕਿਸਾਨ ਕਾਲ ਸੈਂਟਰ (ਕੇਸੀਸੀ) ਨਾਲ ਸੰਪਰਕ ਕਰੋ (ਟੋਲ ਫ੍ਰੀ ਨੰਬਰ 1800-180-1551) """);

        } else if (disease.equalsIgnoreCase("POWDERY MILDEW")) {
            remedy.setText("""
                    1. ਬਿਮਾਰੀਆਂ ਪ੍ਰਤੀ ਰੋਧਕ ਕਿਸਮਾਂ ਉਗਾਓ।
                    2. ਵਾਢੀ ਦੇ ਖਤਮ ਹੋਣ ਤੋਂ ਬਾਅਦ ਖੇਤ ਵਿੱਚ ਝਾੜੀਆਂ ਦੀ ਫਸਲ ਨੂੰ ਛੱਡ ਦਿਓ।
                    3. ਜੇਕਰ ਨੁਕਸਾਨ ਜ਼ਿਆਦਾ ਹੋਣ ਦੀ ਸੰਭਾਵਨਾ ਹੈ, ਤਾਂ ਡਾਇਥੇਨ ਐਮ-45 ਦੇ ਮਿਸ਼ਰਣ ਨਾਲ ਛਿੜਕਾਅ ਕਰੋ।
                    ਕਰਥਾਨੇ ਨੂੰ ਲਾਭਦਾਇਕ ਪਾਇਆ ਗਿਆ ਹੈ। ਦੇ 16 ਹਿੱਸੇ ਮਿਲਾ ਕੇ ਮਿਸ਼ਰਣ ਤਿਆਰ ਕਰੋ
                    ਡਾਇਥੇਨ ਐੱਮ-45 ਅਤੇ ਕਰਾਥੇਨ-25 ਵੇਟੇਬਲ ਪਾਊਡਰ ਦੇ 4 ਹਿੱਸੇ। @2 ਮਿਸ਼ਰਣ ਦਾ ਛਿੜਕਾਅ ਕਰੋ
                    ਕਿਲੋਗ੍ਰਾਮ/ਹੈਕਟੇਅਰ 1000 ਲੀਟਰ ਪਾਣੀ ਵਿੱਚ ਘੋਲਿਆ ਜਾਂਦਾ ਹੈ। ਲਗਭਗ ਤਿੰਨ ਸਪਰੇਆਂ ਕਾਫੀ ਹੋਣਗੀਆਂ
                    10-15 ਦਿਨਾਂ ਦੇ ਅੰਤਰਾਲ 'ਤੇ. ਵੱਖ-ਵੱਖ ਸਪਰੇਆਂ ਲਈ ਪਾਣੀ ਦੀ ਮਾਤਰਾ ਹੋ ਸਕਦੀ ਹੈ
                    ਫਸਲ ਦੇ ਵਧਣ ਦੇ ਪੜਾਅ ਦੇ ਆਧਾਰ 'ਤੇ ਫੈਸਲਾ ਕੀਤਾ ਜਾਂਦਾ ਹੈ।


                    ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ https://farmer.gov.in/FarmerHome.aspx 'ਤੇ ਜਾਓ


                    ਜਾਂ ਕਿਸਾਨ ਕਾਲ ਸੈਂਟਰ (ਕੇਸੀਸੀ) ਨਾਲ ਸੰਪਰਕ ਕਰੋ (ਟੋਲ ਫ੍ਰੀ ਨੰਬਰ 1800-180-1551) """);
        } else if (disease.equalsIgnoreCase("SEPTORIA")) {
            remedy.setText("""
                    ਇੱਕ ਉੱਚ ਸੇਪਟੋਰੀਆ ਟ੍ਰਾਈਟੀਸੀ ਪ੍ਰਤੀਰੋਧ ਰੇਟਿੰਗ ਦੇ ਨਾਲ ਇੱਕ ਕਿਸਮ ਉਗਾਓ
                    ਅਗੇਤੀ ਡ੍ਰਿਲਿੰਗ ਤੋਂ ਬਚੋ, ਖਾਸ ਕਰਕੇ ਸੰਵੇਦਨਸ਼ੀਲ ਕਿਸਮਾਂ ਦੀ
                    T2 ਉੱਲੀਨਾਸ਼ਕ ਸਮਾਂ ਸਭ ਤੋਂ ਮਹੱਤਵਪੂਰਨ ਹੈ, T1 ਦੇ ਨਾਲ ਸੇਪਟੋਰੀਆ ਟ੍ਰਾਈਟੀਸੀ ਨਿਯੰਤਰਣ ਨੂੰ ਵੀ ਨਿਸ਼ਾਨਾ ਬਣਾਇਆ ਗਿਆ ਹੈ। ਹਾਲਾਂਕਿ, T0 ਸਪਰੇਅ ਘੱਟ ਹੀ ਝਾੜ ਦਾ ਲਾਭ ਦਿੰਦੀ ਹੈ
                    ਮਲਟੀਸਾਈਟ (ਜਿੱਥੇ ਸੰਭਵ ਹੋਵੇ) ਦੇ ਨਾਲ ਇੱਕ ਅਜ਼ੋਲ ਦੇ ਸੰਤੁਲਿਤ ਮਿਸ਼ਰਣ ਦੀ ਵਰਤੋਂ ਕਰੋ। ਸਿਰਫ਼ ਉਦੋਂ ਹੀ ਇੱਕ SDHI ਸ਼ਾਮਲ ਕਰੋ ਜਦੋਂ ਬਿਮਾਰੀ ਦੇ ਜੋਖਮ ਦੇ ਯੋਗ ਹੋਣ
                    ਲੋੜੀਂਦਾ ਨਿਯੰਤਰਣ ਪ੍ਰਾਪਤ ਕਰਨ ਲਈ ਸਭ ਤੋਂ ਘੱਟ ਖੁਰਾਕ ਦੀ ਵਰਤੋਂ ਕਰੋ, ਪਰ ਇਹ ਸੁਨਿਸ਼ਚਿਤ ਕਰੋ ਕਿ ਮਿਸ਼ਰਣ ਦਾ ਹਰੇਕ ਹਿੱਸਾ ਨਿਯੰਤਰਣ ਦੇ ਤੁਲਨਾਤਮਕ ਪੱਧਰ ਦਿੰਦਾ ਹੈ।


                    ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ https://farmer.gov.in/FarmerHome.aspx 'ਤੇ ਜਾਓ
                    %0A%0A
                    ਜਾਂ ਕਿਸਾਨ ਕਾਲ ਸੈਂਟਰ (ਕੇਸੀਸੀ) ਨਾਲ ਸੰਪਰਕ ਕਰੋ (ਟੋਲ ਫ੍ਰੀ ਨੰਬਰ 1800-180-1551) """);
        } else if (disease.equalsIgnoreCase("SEEDLING")) {
            remedy.setText("ਕੋਈ ਉਪਾਅ ਉਪਲਬਧ ਨਹੀਂ ਹੈ");
        } else {
            remedy.setText("ਤੁਹਾਡੇ ਕੋਲ ਸਿਹਤਮੰਦ ਫਸਲ ਹੈ");
        }
        remedy.setChatId(chatId);
        return remedy;
    }
}
